import ast


def ぽヘぽぽヘぽぽヘヘぽぽヘぽヘヘぽぽぽぽぽぽぽヘぽヘヘぽヘぽヘヘぽ():
    return 1062700 + 613790 - 781642 ^ 894852


def ヘぽヘぽヘヘぽぽヘぽぽヘヘぽぽヘぽヘヘヘぽぽヘヘぽヘぽぽぽぽぽヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽヘぽぽぽヘぽヘぽぽヘヘヘヘぽヘぽヘぽヘぽヘぽぽぽぽぽヘぽぽぽぽぽヘぽぽぽぽぽヘぽぽぽぽぽヘヘヘぽぽヘぽヘヘぽぽヘぽヘヘヘヘぽヘぽぽヘヘヘぽヘぽヘヘヘヘぽぽヘぽヘヘぽヘヘヘぽヘぽぽぽぽぽヘぽぽぽヘぽヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽぽぽヘぽヘぽヘぽヘヘヘぽぽぽぽヘヘヘぽぽヘぽヘヘぽヘぽぽヘヘヘぽヘヘヘぽヘヘヘぽヘぽぽヘぽヘぽぽぽヘヘぽぽヘヘぽヘぽぽぽヘぽヘヘヘヘぽヘヘヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽヘぽぽぽヘぽヘぽぽヘヘヘヘヘヘぽヘヘぽぽぽヘぽヘぽヘぽぽヘヘぽヘぽ():
    return chr(int(10 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(102 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(104 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(103 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(40 / 2 * 2)) + chr(int(41 / 2 * 2)) + chr(int(58 / 2 * 2)) + chr(int(10 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(32 / 2 * 2)) + chr(int(34 / 2 * 2)) + chr(int(104 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(103 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(34 / 2 * 2)) + chr(int(10 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(40 / 2 * 2)) + chr(int(102 / 2 * 2)) + chr(int(34 / 2 * 2)) + chr(int(123 / 2 * 2)) + chr(int(104 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(103 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(40 / 2 * 2)) + chr(int(41 / 2 * 2)) + chr(int(125 / 2 * 2)) + chr(int(34 / 2 * 2)) + chr(int(41 / 2 * 2)) + chr(int(10 / 2 * 2))


MWWMMMWWMWWMWWWWMWWMMWMMMWWMMWMW = ヘぽヘぽヘヘぽぽヘぽぽヘヘぽぽヘぽヘヘヘぽぽヘヘぽヘぽぽぽぽぽヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽヘぽぽぽヘぽヘぽぽヘヘヘヘぽヘぽヘぽヘぽヘぽぽぽぽぽヘぽぽぽぽぽヘぽぽぽぽぽヘぽぽぽぽぽヘヘヘぽぽヘぽヘヘぽぽヘぽヘヘヘヘぽヘぽぽヘヘヘぽヘぽヘヘヘヘぽぽヘぽヘヘぽヘヘヘぽヘぽぽぽぽぽヘぽぽぽヘぽヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽぽぽヘぽヘぽヘぽヘヘヘぽぽぽぽヘヘヘぽぽヘぽヘヘぽヘぽぽヘヘヘぽヘヘヘぽヘヘヘぽヘぽぽヘぽヘぽぽぽヘヘぽぽヘヘぽヘぽぽぽヘぽヘヘヘヘぽヘヘヘヘぽヘぽぽぽヘヘぽヘヘヘヘヘヘぽぽヘヘヘヘヘぽぽヘぽヘヘぽヘぽぽぽヘぽヘぽぽヘヘヘヘヘヘぽヘヘぽぽぽヘぽヘぽヘぽぽヘヘぽヘぽ()
exec(MWWMMMWWMWWMWWWWMWWMMWMMMWWMMWMW)
print()
MWWWMWMMMWWWMMWMMWWMMWMWMWWMMWMW = ast.parse(MWWMMMWWMWWMWWWWMWWMMWMMMWWMMWMW)
print(ast.dump(MWWWMWMMMWWWMMWMMWWMMWMWMWWMMWMW,
      indent=ぽヘぽぽヘぽぽヘヘぽぽヘぽヘヘぽぽぽぽぽぽぽヘぽヘヘぽヘぽヘヘぽ()))
print(ast.unparse(MWWWMWMMMWWWMMWMMWWMMWMWMWWMMWMW))
