def へヘヘヘヘへヘへヘへヘヘヘへへへヘヘへヘヘへへヘへへヘへへヘヘヘ():
    return 'integer'

def へヘへへへへへへヘヘへヘへへヘヘへへへへへヘヘへヘへへへヘへヘヘへヘ():
    return 'integer'

def へヘへへヘへへヘヘへへヘへヘヘへへへへへへへヘへヘへヘへヘへへヘ():
    return 'integer'

def ヘヘへへヘへへヘヘへへヘへヘヘヘへへヘヘへ():
    return chr(int(100 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(102 / 2 * 2))

def ヘヘへへへへヘヘヘへへへヘへヘヘへへへヘヘ():
    return chr(int(97 / 2 * 2)) + chr(int(98 / 2 * 2)) + chr(int(99 / 2 * 2))
print('Hello, world!')
O0O00000O = ヘヘへへへへヘヘヘへへへヘへヘヘへへへヘヘ()
O0O0000O0 = ヘヘへへヘへへヘヘへへヘへヘヘヘへへヘヘへ()
O0O0000OO = へヘへへヘへへヘヘへへヘへヘヘへへへへへへへヘへヘへヘへヘへへヘ()
O0O000O00 = へヘへへへへへへヘヘへヘへへヘヘへへへへへヘヘへヘへへへヘへヘヘへヘ()
O0O000O0O = へヘヘヘヘへヘへヘへヘヘヘへへへヘヘへヘヘへへヘへへヘへへヘヘヘ()
print(O0O00000O, O0O0000O0, O0O0000OO, O0O000O00, O0O000O0O)