def ほげほほげほほげげほほげほげげほほほほほほほげほげほげほげほほげ():
    return 1405842 + 236961 - 855966 ^ 786926

def ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげげ():
    return 246913 + 866340 - 518262 ^ 594990

def げげほげほほほげげほげげげげげげほげげげほげげほげほほげ():
    return chr(int(104 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(105 / 2 * 2))

class ほげほげほほげげほげげほほほほげほげげほげげほげほげげげほほほほほげげほげげほほほげげほほげほげ:

    def __init__(self):
        (self.ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ, self.ほげげほげほほげほげげほほげほほ) = (げげほげほほほげげほげげげげげげほげげげほげげほげほほげ(), ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげげ())

    def ほげげほほげげげほげげほほげほげほげげげほげほほほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ(self):
        return self.ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ

class ほげほげほほげげほげげほほほほげほげげほげげほげほげげげほほほほほげげほげげほほほげげほほげほげほげほほほげほげほげほげげほほほ:

    def __init__(self):
        ほげげげほほげげ = ほげほげほほげげほげげほほほほげほげげほげげほげほげげげほほほほほげげほげげほほほげげほほげほげ()
        self.ほげげほほほほげほげげほほほげほほげげほほほげげ = ほげげげほほげげ.ほげげほほげげげほげげほほげほげほげげげほげほほほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ()
        self.ほげげほほげほほ = ほげげげほほげげ.ほげげほげほほげほげげほほげほほ
ほげげげほほげげ = ほげほげほほげげほげげほほほほげほげげほげげほげほげげげほほほほほげげほげげほほほげげほほげほげほげほほほげほげほげほげげほほほ()
print(ほげげげほほげげ.ほげげほほほほげほげげほほほげほほげげほほほげげ, ほげげげほほげげ.ほげげほほげほほ)
ほげげげほほげげ.ほげげげげほほほほげげげげほほげほげげげげほげほ = ほげほほげほほげげほほげほげげほほほほほほほげほげほげほげほほげ()
print(ほげげげほほげげ.ほげげげげほほほほげげげげほほげほげげげげほげほ)