import ast


def げほげげげほ():
    return chr(int(46 / 2 * 2))


def げげほほほほげげげげほげほほげげげほげほほげげげほほげほ():
    return chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(114 / 2 * 2))


def げげほげげほげげげほげげげげげげほほげほほげげほほげほげ():
    return chr(int(109 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(101 / 2 * 2))


def げげほほほほげげげげほほげほげげほほげげげ():
    return chr(int(97 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(103 / 2 * 2))


def げげげほほげほ():
    return chr(int(114 / 2 * 2))


def ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげげ():
    return 1269357 + 157542 - 878784 ^ 548114


def ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげほ():
    return 657566 + 251417 - 403095 ^ 505888


def げげほほほほげげげげほほげほげげほほげげげげげげほほげげ():
    return chr(int(97 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(103 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげほげげげげげげげほほほほげげほほげほげげげほげげげほ():
    return chr(int(111 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(110 / 2 * 2))


def げげほげほほげげげほほげほほ():
    return chr(int(105 / 2 * 2)) + chr(int(100 / 2 * 2))


def げげほほげげほげげげほげほげげげほげげげほげげほほほげげ():
    return chr(int(102 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(99 / 2 * 2))


def げほげげげげげげほげげげげげ():
    return chr(int(95 / 2 * 2)) + chr(int(95 / 2 * 2))


def ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ():
    return 301340 + 719248 - 213122 ^ 807466


def ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげほ():
    return 131622 + 561026 - 107856 ^ 584793


def げげほほげほげげげげほげげほげげほほほほげげげほげげほほ():
    return chr(int(101 / 2 * 2)) + chr(int(118 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(108 / 2 * 2))


def げげほほげほげげげげげほほほげげほほげほげげげほほほげげ():
    return chr(int(101 / 2 * 2)) + chr(int(120 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(99 / 2 * 2))


def げげほほげほほげげほほほほげげげげほげほほげげほほげほげげげげほげほほげげほげほほげげげほげげほげげげほほげほげ():
    return chr(int(100 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(109 / 2 * 2)) + chr(int(101 / 2 * 2))


def げげほほげほほげげほほほほげげげげほげほほげげほほほほげげげほほほげげげげほげげほほげげほほほほげげげげほほげげげげげほほげげげげほほげほげげげげほほげげ():
    return chr(int(100 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(115 / 2 * 2)) + chr(int(115 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげげほげほげげげほげげげほげげほげほほげげげほほほげげげげほげげげげげげほほげほほげげほほげほげげげほほげほほげげほほほほげげげげほげほほげげほほほほげ():
    return chr(int(117 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(97 / 2 * 2))


def げげほげほほげげげげほげほほげげほほげほげげげげほほげほげげげほげほほげげほげげげげげげほげげげげげげほげげほほげげげほほげげ():
    return chr(int(105 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげげほほげほげげほほげほげ():
    return chr(int(114 / 2 * 2)) + chr(int(101 / 2 * 2))


def げげげほほほほげげげほほほほげげげほほげほげげほげほほげげげほげげげほげげげほげほほ():
    return chr(int(112 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(116 / 2 * 2))


def げげほほほげげげげほげげげげげげほげげほほげげほげげほほげげほほげほげげげほほほげげげげげほげほほげげほげほほげげげほげげげげげげほげげげほげげげほほげげ():
    return chr(int(99 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげほげげげほげげげほげほげげげほげげほげげげげほほほほげげげげほほげ():
    return chr(int(110 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(109 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(121 / 2 * 2))


def げげげほほげげげげげほげほほげげげほほげほげげほげほほげげげほげげげほげげほほげげげ():
    return chr(int(115 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(103 / 2 * 2))


def げげげほほげげげげげほげほほげげほほほほげげげげほげほほげげほげほほげげげげほほげげげげげほげほほげげほげほほげげげほほほげげげげげほほげげ():
    return chr(int(115 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(115 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげほほげほほげげほほげほげげげほほほげげげげほげほほげげげほげげほげげげほほほほげげげほげげほほ():
    return chr(int(100 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(109 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(108 / 2 * 2))


def げげほほげほほげげほげほほげげげほほげげほげげほほげげほげげほげげほほげげほげほほげげげほほほげほ():
    return chr(int(100 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(102 / 2 * 2)) + chr(int(102 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(98 / 2 * 2))


def げげげほほほほげげほほほほげげげほげげげほげげほほげほほげげほほほほげげげげほほげげ():
    return chr(int(112 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげげほほほげげげげほげほげげげほほげほげげげげほげほげげげほほげほげ():
    return chr(int(113 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(101 / 2 * 2))


def げげほほほげげげげほげげげげげげげほほほほげげげげほほげ():
    return chr(int(99 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(121 / 2 * 2))


def げげほげげほげげげほほほほげげげげほげほほげげほげほほほ():
    return chr(int(109 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(104 / 2 * 2))


def げげほほげげほげげげほげほげげげほげげげほげげほほほげげげげげほげほほげげほげげげげげげほげげげげげげほげげほほげげげほほげげ():
    return chr(int(102 / 2 * 2)) + chr(int(117 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(108 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげほげほげほげげげほほげげげげほげげげげげげほげげげほ():
    return chr(int(106 / 2 * 2)) + chr(int(115 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(110 / 2 * 2))


def げげほほげげほげげげほほげほげげほほほほげげげほほほげげげげげほげほほげげほげほほげげげほげげげげげげほげげげほげげげほほげげ():
    return chr(int(102 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(99 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(105 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(115 / 2 * 2))


def げげほげげげげげげげほほほほげげほほげほげげげげほほげほげげほほほほげげげげほげほほげげほげげげげげげげほほげほ():
    return chr(int(111 / 2 * 2)) + chr(int(112 / 2 * 2)) + chr(int(101 / 2 * 2)) + chr(int(114 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(116 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(114 / 2 * 2))


def げげげほほげほげげほほほほげげげほげげげほげげほほげほほげげほげげげげげげほげげほげ():
    return chr(int(114 / 2 * 2)) + chr(int(97 / 2 * 2)) + chr(int(110 / 2 * 2)) + chr(int(100 / 2 * 2)) + chr(int(111 / 2 * 2)) + chr(int(109 / 2 * 2))


class ほげほほほほげほほげげほほほほげほげげほげげげほほげほほほほげげほげげほげげげげほげげほほげほほほげげほほげほげほげほほほほげげほげげほげほほほほげげほほげほげほげげほほほげげほげげほげほげげ(ast.NodeTransformer):
    ほげげげほげげげほげげほげほほほほげげほげほほげほげげげほげほほほげげほほげほげほげほげげげげげほげげほげげほほほげげほげほほげほげげげほほげげほげげげほげほほ = [げげげほほげほげげほほほほげげげほげげげほげげほほげほほげげほげげげげげげほげげほげ(), げげほげげげげげげげほほほほげげほほげほげげげげほほげほげげほほほほげげげげほげほほげげほげげげげげげげほほげほ(), げげほほげげほげげげほほげほげげほほほほげげげほほほげげげげげほげほほげげほげほほげげげほげげげげげげほげげげほげげげほほげげ(), げげほげほげほげげげほほげげげげほげげげげげげほげげげほ(), げげほほげげほげげげほげほげげげほげげげほげげほほほげげげげげほげほほげげほげげげげげげほげげげげげげほげげほほげげげほほげげ(), げげほげげほげげげほほほほげげげげほげほほげげほげほほほ(), げげほほほげげげげほげげげげげげげほほほほげげげげほほげ(), げげげほほほげげげげほげほげげげほほげほげげげげほげほげげげほほげほげ(), げげげほほほほげげほほほほげげげほげげげほげげほほげほほげげほほほほげげげげほほげげ(), げげほほげほほげげほげほほげげげほほげげほげげほほげげほげげほげげほほげげほげほほげげげほほほげほ(), げげほほげほほげげほほげほげげげほほほげげげげほげほほげげげほげげほげげげほほほほげげげほげげほほ(
    ), げげげほほげげげげげほげほほげげほほほほげげげげほげほほげげほげほほげげげげほほげげげげげほげほほげげほげほほげげげほほほげげげげげほほげげ(), げげげほほげげげげげほげほほげげげほほげほげげほげほほげげげほげげげほげげほほげげげ(), げげほげげげほげげげほげほげげげほげげほげげげげほほほほげげげげほほげ(), げげほほほげげげげほげげげげげげほげげほほげげほげげほほげげほほげほげげげほほほげげげげげほげほほげげほげほほげげげほげげげげげげほげげげほげげげほほげげ(), げげげほほほほげげげほほほほげげげほほげほげげほげほほげげげほげげげほげげげほげほほ(), げげげほほげほげげほほげほげ(), げげほげほほげげげげほげほほげげほほげほげげげげほほげほげげげほげほほげげほげげげげげげほげげげげげげほげげほほげげげほほげげ(), げげげほげほげげげほげげげほげげほげほほげげげほほほげげげげほげげげげげげほほげほほげげほほげほげげげほほげほほげげほほほほげげげげほげほほげげほほほほげ(), げげほほげほほげげほほほほげげげげほげほほげげほほほほげげげほほほげげげげほげげほほげげほほほほげげげげほほげげげげげほほげげげげほほげほげげげげほほげげ(), げげほほげほほげげほほほほげげげげほげほほげげほほげほげげげげほげほほげげほげほほげげげほげげほげげげほほげほげ()]
    ほげげほほほげほほげげほげげほほほげげほほほほげほげげほほほげげほげげほげほげげほげほげげげげげほげげほげげほほほげげほげほほげほげげげほほげげほげげげほげほほ = [
        げげほほげほげげげげげほほほげげほほげほげげげほほほげげ(), げげほほげほげげげげほげげほげげほほほほげげげほげげほほ()]

    @property
    def excluded(self):
        return self.ほげほげげげげげほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ

    def __init__(self, ほげげほほほげげほげげほげげげげほげげほほげほほほげげほほげほげ):
        super().__init__()
        self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ = []
        self.ほげほげげげげげほげげほほほげげほげげほげげげげほげげほほげほほほげげほほげほげ = ほげげほほほげげほげげほげげげげほげげほほげほほほげげほほげほげ
        self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげほ()
        self.ほげほげげげげげほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ = []

    def check(self):
        try:
            self.ほげげげほげげほほげげほげほほげほげげげほほげげほげげほげほほげほげげげほげほほ(
                ast.parse(self.ほげほげげげげげほげげほほほげげほげげほげげげげほげげほほげほほほげげほほげほげ))
        except Exception:
            return ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげほ()
        ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ = list(
            set(self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ))
        for ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ in ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ:
            if ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ in self.ほげげほほほげほほげげほげげほほほげげほほほほげほげげほほほげげほげげほげほげげほげほげげげげげほげげほげげほほほげげほげほほげほげげげほほげげほげげげほげほほ:
                self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
                self.ほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ.append(
                    ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
            if ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ.startswith(げほげげげげげげほげげげげげ()):
                self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
                self.ほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ.append(
                    ほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
        return self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ

    def visit(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ):
        super().visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)

    def visit_Call(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ: ast.Call):
        if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ, げげほほげげほげげげほげほげげげほげげげほげげほほほげげ()):
            if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.func, げげほげほほげげげほほげほほ()):
                self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
                    ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.func.id)
                if ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.func.id == げげほげげげげげげげほほほほげげほほげほげげげほげげげほ():
                    if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ, げげほほほほげげげげほほげほげげほほげげげげげげほほげげ()) and len(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.keywords) == ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげほ():
                        ほげげほげげほげほげげほげげげげほげげほほげほほほげげほほげほげ = ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.args[ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげげ(
                        )].value
                        if ほげげほげげほげほげげほげげげげほげげほほげほほほげげほほげほげ != げげげほほげほ():
                            self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
                    ほげげほげほげげほげげほほげほげほげげげげほほげほげげげほげげげほげげほげげげげほげげげほほげほほげげほほげほほほげげげほほげげ = ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.keywords
                    for ほげげほげほげげほげげげほげげげ in ほげげほげほげげほげげほほげほげほげげげげほほげほげげげほげげげほげげほげげげげほげげげほほげほほげげほほげほほほげげげほほげげ:
                        if hasattr(ほげげほげほげげほげげげほげげげ, げげほほほほげげげげほほげほげげほほげげげ()):
                            if ほげげほげほげげほげげげほげげげ.arg == げげほげげほげげげほげげげげげげほほげほほげげほほげほげ():
                                if ほげげほげほげげほげげげほげげげ.value.s != げげげほほげほ():
                                    self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
            if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.func, げげほほほほげげげげほげほほげげげほげほほげげげほほげほ()):
                self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
                    ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.func.attr)
        super().generic_visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)

    def visit_Attribute(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ: ast.Attribute):
        if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ, げげほほほほげげげげほげほほげげげほげほほげげげほほげほ()):
            self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
                ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.attr)
        super().generic_visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)

    def visit_Name(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ):
        super().generic_visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)
        if hasattr(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ, げげほげほほげげげほほげほほ()):
            self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
                ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.id)

    def visit_Import(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ: ast.Import):
        for ほげげほほほほげほげげほげげほほほげげほげほほげほげげほほほほげほげげげほほげげ in ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.names:
            ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ = ほげげほほほほげほげげほげげほほほげげほげほほげほげげほほほほげほげげげほほげげ.name.split(げほげげげほ())[
                ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげほ()]
            self.ほげげほほほげげほげげほげほほほほげげほほげほげほげげほほほげげほげげほげほげげほげほげげげげげほげげほげげほげほげげほげげげげほげげほほげほほほげげほげげほほほげげげほげほげほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ(
                ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
            self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
                ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
        super().generic_visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)

    def visit_ImportFrom(self, ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ: ast.ImportFrom):
        ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ = ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ.module.split(げほげげげほ())[
            ほげほほげほほげげほほげほげげほほほほほほほげほげげほげほほげほ()]
        self.ほげげほほほげげほげげほげほほほほげげほほげほげほげげほほほげげほげげほげほげげほげほげげげげげほげげほげげほげほげげほげげげげほげげほほげほほほげげほげげほほほげげげほげほげほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ(
            ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
        self.ほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげほげげげほほげげ.append(
            ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
        super().generic_visit(ほげげほげげげほほげげほげげげげほげげほほげほほほげげほほげほげ)

    def check_modlue_name(self, ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ):
        if ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ not in self.ほげげげほげげげほげげほげほほほほげげほげほほげほげげげほげほほほげげほほげほげほげほげげげげげほげげほげげほほほげげほげほほげほげげげほほげげほげげげほげほほ:
            self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
            self.ほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ.append(
                ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
        if ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ.startswith(げほげげげげげげほげげげげげ()):
            self.ほげほげげげげげほげげほほほほげほげげほげげほほほげげほげげほほほげげほげげげげほげげげほげげげ = ほげげげげほげほげほげげげほほほげげほげげほほげほほげほほげげげ()
            self.ほげげほほげほげほげげげげほほほほげげほほほげげほげげほげげほほほげげげほげほげほげげほほげほほほげげほほげほげほげげほほげほほ.append(
                ほげげほげげほげほげげほげげげげほげげほほげほほほげげげほげほげほげげほげげほほほげげほほげほげほげほげげげげげほげげほげげげほほげげほほほほげほげげほげげほげほげげほほげほげ)
