def へヘヘヘヘヘヘヘヘへヘヘヘへ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(83) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(113) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへへへへへへへヘヘヘヘへ():
    return 293847 + 941931 - 319651 ^ 916118


def へヘヘへヘへヘヘヘへヘヘヘへへヘヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(73) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘへヘヘヘヘヘへヘヘへヘヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(67) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(103) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(104) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(118) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(121) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(122) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114)


def へヘへへへへへヘへヘへヘへへへへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(83) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(113) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘへへヘへへヘへへヘへへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへへへへヘヘへへへへへヘ():
    return 202150 + 672963 - 483151 ^ 391967


def へヘヘへへヘへヘへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(68) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(86) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへヘへヘヘへヘへへヘへへヘ():
    return 230840 + 441214 - 391760 ^ 280300


def へヘヘヘヘヘヘヘヘへヘへへへへ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(112) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100)


def へヘヘへへヘへへヘへヘへヘへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(103) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100)


def へヘヘヘへヘへへへヘへへへヘへ():
    return 867090 + 397118 - 332483 ^ 931727


def へヘへへヘヘヘへへへへへへへへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘへへヘへヘへヘへへヘへへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘヘへヘへヘへへヘへヘヘヘヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘヘヘヘヘへへヘヘヘへヘへへへヘ():
    return 724846 + 802395 - 873870 ^ 641251


def へヘヘヘへヘへへヘへヘへへヘヘ():
    return 1223259 + 267961 - 983603 ^ 495257


def へヘへへヘへヘへへヘへヘヘヘ():
    return 1197769 + 164907 - 451811 ^ 910870


def へヘヘヘへヘヘへへヘへへヘへへ():
    return 680918 + 374309 - 497680 ^ 557530


def へヘヘへヘヘヘへへへヘヘヘへへ():
    return 651195 + 299311 - 266196 ^ 684326


def へヘヘへへへへへヘへヘヘへへヘヘヘ():
    return 1475943 + 247800 - 890569 ^ 833174


def へヘへヘへヘヘヘヘへへヘヘへヘヘヘ():
    return 535809 + 617912 - 900356 ^ 253427


def へヘヘへヘヘヘへヘへへへヘヘヘヘ():
    return 313189 + 794823 - 163753 ^ 944320


def へヘへヘへヘへヘへヘヘへへヘ():
    return 210779 + 242801 - 195400 ^ 258233


def へヘヘヘへヘへへへへヘへヘへへヘへ():
    return 185163 + 397123 - 150379 ^ 431906


def へヘヘへヘヘへヘへへヘヘへへヘヘへ():
    return 488195 + 186604 - 304349 ^ 370460


(へヘヘへへヘヘヘへへへへへヘヘヘヘ, へヘへへヘヘヘヘヘへヘヘへへヘへへ) = ({}, {})
exec('', へヘヘへへヘヘヘへへへへへヘヘヘヘ, へヘへへヘヘヘヘヘへヘヘへへヘへへ)
へヘへへヘへヘへへヘヘヘへ = {}
for (へヘヘへヘへへヘヘへヘへへヘへヘヘ, へヘへへヘへヘヘヘへヘへヘ) in へヘヘへへヘヘヘへへへへへヘヘヘヘ.items():
    へヘへヘヘへヘへヘへへへヘへヘ = へヘヘへヘへへヘヘへヘへへヘへヘヘ
へヘへへへへヘヘへヘへへヘへへヘ = list(へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].items())
へヘへへヘへへへヘヘヘヘヘヘヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘヘへヘヘへヘへへヘヘへへヘヘへ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘへへへへへへヘヘへへヘへヘヘへ = へヘへへへへヘヘへヘへへヘへへヘ[へヘへヘへヘへヘへヘヘへへヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘヘへヘへヘへへへヘヘヘへヘへヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘヘへヘヘヘへヘへへへヘヘヘヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘヘへへへヘへへへヘヘへへヘヘヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘへヘへヘヘヘヘへへヘヘへヘヘヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]


def へヘヘヘヘヘへヘヘへへへへヘへヘヘ(へヘヘへヘヘへヘへへヘへヘヘへヘへ):
    へヘへへへへヘヘヘヘヘへへへへヘヘ = ''.join([''.join([へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘへヘヘヘへへへヘヘヘへへ()) if へヘヘへヘへヘへへへへへヘヘヘヘ >> へヘヘヘヘへヘへヘヘヘヘへへ & へヘヘヘへヘへへへへヘへヘへへヘへ() == へヘヘへへへへへヘへヘヘへへヘヘヘ() else へヘへへヘへへへヘヘヘヘヘヘヘ(
        へヘヘヘへヘヘへへヘへへヘへへ()) for へヘヘヘヘへヘへヘヘヘヘへへ in へヘヘへへへヘへへへヘヘへへヘヘヘ(へヘへへヘへヘへへヘへヘヘヘ(), -へヘヘヘへヘへへへへヘへヘへへヘへ(), -へヘヘヘへヘへへへへヘへヘへへヘへ())]) for へヘヘへヘへヘへへへへへヘヘヘヘ in へヘヘへヘヘへヘへへヘへヘヘへヘへ.encode()])
    return ''.join([へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘヘへヘへへヘへヘへへヘヘ()) if へヘヘへヘへヘヘヘへヘへへヘへへ == へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘへヘヘヘへへへヘヘヘへへ()) else へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘヘヘヘへへヘヘヘへヘへへへヘ()) for へヘヘへヘへヘヘヘへヘへへヘへへ in へヘへへへへヘヘヘヘヘへへへへヘヘ])


for (へヘヘへヘへへヘヘへヘへへヘへヘヘ, へヘへへヘへヘヘヘへヘへヘ) in へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].items():
    へヘへへヘへヘへへヘヘヘへ[へヘヘヘヘヘへヘヘへへへへヘへヘヘ(へヘヘへヘへへヘヘへヘへへヘへヘヘ)] = へヘへへヘへヘヘヘへヘへヘ
へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].update(へヘへへヘへヘへへヘヘヘへ)
へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘヘへヘへヘへへヘへヘヘヘヘへヘ()][へヘヘヘヘヘへヘヘへへへへヘへヘヘ(
    へヘへへヘへヘへヘへへヘへへヘへヘ())] = へヘへへヘヘヘへへへへへへへへヘ()


class へヘヘへヘへヘヘへヘへヘへヘへへへ:

    def __init__(self, へヘヘヘヘへへヘヘヘヘヘへヘへ):
        self.へヘヘヘヘへへヘヘヘヘヘへヘへ = へヘヘヘヘへへヘヘヘヘヘへヘへ

    def へヘへへヘへへへへへへへへへへヘヘ(self):
        return self.へヘヘヘヘへへヘヘヘヘヘへヘへ * へヘヘヘへヘへへへヘへへへヘへ()


def へヘへヘヘヘヘヘヘへへヘヘへへへ(へヘへへヘへへへヘヘヘヘヘへヘヘ):

    def へヘヘヘへへヘへへヘへヘへへヘへ(*へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ):
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘヘへへヘへへヘへヘへヘへヘへヘ())
        へヘへヘへヘへへへへへヘへへヘへ = へヘへへヘへへへヘヘヘヘヘへヘヘ(
            *へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ)
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘヘヘヘヘヘヘヘへヘへへへへ())
        return へヘへヘへヘへへへへへヘへへヘへ
    return へヘヘヘへへヘへへヘへヘへへヘへ


@へヘへヘヘヘヘヘヘへへヘヘへへへ
def へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ, へヘへヘヘヘヘヘヘヘへヘへヘヘへ):
    return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘへヘヘヘヘヘヘヘへヘへヘヘへ


def へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘへへヘへヘヘへへヘへへへへ):
    for へヘヘヘヘへヘへヘヘヘヘへへ in へヘヘヘへへヘへへヘヘへへへへヘへヘヘへヘヘヘへへヘヘへへヘヘヘへヘヘへへヘへヘ(へヘヘへへヘへヘヘへへヘへへへへ):
        yield (へヘヘヘヘへヘへヘヘヘヘへへ ** へヘヘヘへヘへへへヘへへへヘへ())


def へヘへへヘへヘへへへヘへへへへヘへ():
    へヘヘヘヘへヘへへヘヘヘヘヘヘ = へヘヘへヘへヘヘへヘへヘへヘへへへ(へヘヘヘへヘへヘヘへヘへへヘへへヘ())
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへへヘへヘへヘへヘ(), へヘヘヘヘへヘへへヘヘヘヘヘヘ.へヘへへヘへへへへへへへへへへヘヘ())
    へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへへへへヘヘへへへへへヘ(), へヘへへヘへヘへへヘへヘヘヘ())
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへへヘへへヘへへヘへへヘへヘ(), へヘへヘへヘへへへへへヘへへヘへ)
    へヘへへへヘへヘへヘヘヘへヘへへへ = [へヘヘヘへヘヘへヘヘへへへヘヘヘヘ ** へヘヘヘへヘへへへヘへへへヘへ()
                         for へヘヘヘへヘヘへヘヘへへへヘヘヘヘ in へヘヘヘへへヘへへヘヘへへへへヘへヘヘへヘヘヘへへヘヘへへヘヘヘへヘヘへへヘへヘ(へヘヘヘへヘへヘヘへヘへへヘへへヘ())]
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘへへへへへヘへヘへヘへへへへヘ(), へヘへへへヘへヘへヘヘヘへヘへへへ)
    try:
        へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘへヘへヘヘへヘへへヘへへヘ() / へヘヘへへへへへヘへヘヘへへヘヘヘ()
    except へヘへヘヘへヘへへヘヘへへヘへヘへヘヘヘへへヘへへヘヘへヘヘヘヘへヘへへへヘへへへヘヘへヘへへヘへヘヘヘへヘヘへへヘヘへヘへへヘへヘヘヘへへヘヘへヘヘへヘへへヘへヘヘへヘヘヘヘへヘヘへヘヘヘへへヘへへへヘへヘへヘヘヘへへヘへへヘヘヘへへヘへへヘヘへヘヘヘヘへヘヘヘへへヘへ:
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘへヘヘヘヘヘへヘヘへヘヘへヘ())

    def へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ):
        return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘヘヘへヘへへへへヘへヘへへヘへ()
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへヘへヘヘヘへヘヘヘへへヘヘ(), へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへへへへへへへヘヘヘヘへ()))
    for へヘへヘへヘへヘへヘへへへへ in へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘヘへへへへヘヘへへへへへヘ()):
        pass
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘヘヘヘヘヘヘヘへヘヘヘへ(), へヘへヘへヘへヘへヘへへへへ)


if へヘへヘヘヘヘヘへヘへヘヘヘヘヘへヘヘへヘヘヘへへヘヘへへへへヘへヘヘへヘヘへヘへヘヘへへヘへヘへヘへヘヘヘヘヘへヘへヘヘヘヘヘ == へヘへへヘヘヘへへへへへへへへヘ():
    へヘへへヘへヘへへへヘへへへへヘへ()
