def へヘヘヘヘヘヘヘヘへヘヘヘへ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(83) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(113) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへへへへへへへヘヘヘヘへ():
    return 220967 + 304664 - 328645 ^ 196979


def へヘヘへヘへヘヘヘへヘヘヘへへヘヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(73) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘへヘヘヘヘヘへヘヘへヘヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(67) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(103) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(104) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(118) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(121) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(122) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114)


def へヘへへへへへヘへヘへヘへへへへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(83) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(113) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘへへヘへへヘへへヘへへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(114) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへへへへヘヘへへへへへヘ():
    return 319135 + 575924 - 389915 ^ 505149


def へヘヘへへヘへヘへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(68) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(86) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(58) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32)


def へヘヘヘへヘへヘヘへヘへへヘへへヘ():
    return -559923 + 938611 - 138404 ^ 240278


def へヘヘヘヘヘヘヘヘへヘへへへへ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(112) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100)


def へヘヘへへヘへへヘへヘへヘへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(70) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(111) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(103) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(32) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(99) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(100)


def へヘヘヘへヘへへへヘへへへヘへ():
    return 695236 + 177765 - 485590 ^ 387409


def へヘへへヘヘヘへへへへへへへへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘへへヘへヘへヘへへヘへへヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(97) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(109) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(101) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘヘへヘへヘへへヘへヘヘヘヘへヘ():
    return へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(98) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(117) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(108) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(116) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(105) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(110) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(115) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95) + へヘヘへへへヘヘへヘヘへヘへへへへヘヘヘへへヘへ(95)


def へヘヘヘヘヘへへヘヘヘへヘへへへヘ():
    return 986002 + 128289 - 358849 ^ 767530


def へヘヘヘへヘへへヘへヘへへヘヘ():
    return 478634 + 670476 - 781450 ^ 371796


def へヘへへヘへヘへへヘへヘヘヘ():
    return 444915 + 764905 - 344448 ^ 865371


def へヘヘヘへヘヘへへヘへへヘへへ():
    return 968946 + 186967 - 436157 ^ 719805


def へヘヘへヘヘヘへへへヘヘヘへへ():
    return 968444 + 981784 - 981926 ^ 968286


def へヘヘへへへへへヘへヘヘへへヘヘヘ():
    return 419136 + 317720 - 536278 ^ 200578


def へヘへヘへヘヘヘヘへへヘヘへヘヘヘ():
    return 351697 + 758350 - 870312 ^ 239665


def へヘヘへヘヘヘへヘへへへヘヘヘヘ():
    return 175257 + 792605 - 233380 ^ 734545


def へヘへヘへヘへヘへヘヘへへヘ():
    return 1095867 + 406933 - 948011 ^ 554776


def へヘヘヘへヘへへへへヘへヘへへヘへ():
    return 554236 + 549803 - 434389 ^ 669651


def へヘヘへヘヘへヘへへヘヘへへヘヘへ():
    return 546308 + 673414 - 257223 ^ 962509


(へヘヘへへヘヘヘへへへへへヘヘヘヘ, へヘへへヘヘヘヘヘへヘヘへへヘへへ) = ({}, {})
exec('', へヘヘへへヘヘヘへへへへへヘヘヘヘ, へヘへへヘヘヘヘヘへヘヘへへヘへへ)
へヘへへヘへヘへへヘヘヘへ = {}
for (へヘヘへヘへへヘヘへヘへへヘへヘヘ, へヘへへヘへヘヘヘへヘへヘ) in へヘヘへへヘヘヘへへへへへヘヘヘヘ.items():
    へヘへヘヘへヘへヘへへへヘへヘ = へヘヘへヘへへヘヘへヘへへヘへヘヘ
へヘへへへへヘヘへヘへへヘへへヘ = list(へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].items())
へヘへへヘへへへヘヘヘヘヘヘヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘヘへヘヘへヘへへヘヘへへヘヘへ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘへへへへへへヘヘへへヘへヘヘへ = へヘへへへへヘヘへヘへへヘへへヘ[へヘへヘへヘへヘへヘヘへへヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘヘへヘへヘへへへヘヘヘへヘへヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘヘへヘヘヘへヘへへへヘヘヘヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]
へヘヘへへへヘへへへヘヘへへヘヘヘ = へヘへへへへヘヘへヘへへヘへへヘ[へヘへヘへヘヘヘヘへへヘヘへヘヘヘ()][へヘヘヘへヘへへへへヘへヘへへヘへ()]


def へヘヘヘヘヘへヘヘへへへへヘへヘヘ(へヘヘへヘヘへヘへへヘへヘヘへヘへ):
    へヘへへへへヘヘヘヘヘへへへへヘヘ = ''.join([''.join([へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘへヘヘヘへへへヘヘヘへへ()) if へヘヘへヘへヘへへへへへヘヘヘヘ >> へヘヘヘヘへヘへヘヘヘヘへへ & へヘヘヘへヘへへへへヘへヘへへヘへ() == へヘヘへへへへへヘへヘヘへへヘヘヘ() else へヘへへヘへへへヘヘヘヘヘヘヘ(
        へヘヘヘへヘヘへへヘへへヘへへ()) for へヘヘヘヘへヘへヘヘヘヘへへ in へヘヘへへへヘへへへヘヘへへヘヘヘ(へヘへへヘへヘへへヘへヘヘヘ(), -へヘヘヘへヘへへへへヘへヘへへヘへ(), -へヘヘヘへヘへへへへヘへヘへへヘへ())]) for へヘヘへヘへヘへへへへへヘヘヘヘ in へヘヘへヘヘへヘへへヘへヘヘへヘへ.encode()])
    return ''.join([へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘヘへヘへへヘへヘへへヘヘ()) if へヘヘへヘへヘヘヘへヘへへヘへへ == へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘへヘヘヘへへへヘヘヘへへ()) else へヘへへヘへへへヘヘヘヘヘヘヘ(へヘヘヘヘヘへへヘヘヘへヘへへへヘ()) for へヘヘへヘへヘヘヘへヘへへヘへへ in へヘへへへへヘヘヘヘヘへへへへヘヘ])


for (へヘヘへヘへへヘヘへヘへへヘへヘヘ, へヘへへヘへヘヘヘへヘへヘ) in へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].items():
    へヘへへヘへヘへへヘヘヘへ[へヘヘヘヘヘへヘヘへへへへヘへヘヘ(へヘヘへヘへへヘヘへヘへへヘへヘヘ)] = へヘへへヘへヘヘヘへヘへヘ
へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘへヘヘへヘへヘへへへヘへヘ].update(へヘへへヘへヘへへヘヘヘへ)
へヘヘへへヘヘヘへへへへへヘヘヘヘ[へヘヘへヘへヘへへヘへヘヘヘヘへヘ()][へヘヘヘヘヘへヘヘへへへへヘへヘヘ(
    へヘへへヘへヘへヘへへヘへへヘへヘ())] = へヘへへヘヘヘへへへへへへへへヘ()


class へヘヘへヘへヘヘへヘへヘへヘへへへ:

    def __init__(self, へヘヘヘヘへへヘヘヘヘヘへヘへ):
        self.へヘヘヘヘへへヘヘヘヘヘへヘへ = へヘヘヘヘへへヘヘヘヘヘへヘへ

    def へヘへへヘへへへへへへへへへへヘヘ(self):
        return self.へヘヘヘヘへへヘヘヘヘヘへヘへ * へヘヘヘへヘへへへヘへへへヘへ()


def へヘへヘヘヘヘヘヘへへヘヘへへへ(へヘへへヘへへへヘヘヘヘヘへヘヘ):

    def へヘヘヘへへヘへへヘへヘへへヘへ(*へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ):
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘヘへへヘへへヘへヘへヘへヘへヘ())
        へヘへヘへヘへへへへへヘへへヘへ = へヘへへヘへへへヘヘヘヘヘへヘヘ(
            *へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ)
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘヘヘヘヘヘヘヘへヘへへへへ())
        return へヘへヘへヘへへへへへヘへへヘへ
    return へヘヘヘへへヘへへヘへヘへへヘへ


@へヘへヘヘヘヘヘヘへへヘヘへへへ
def へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ, へヘへヘヘヘヘヘヘヘへヘへヘヘへ):
    return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘへヘヘヘヘヘヘヘへヘへヘヘへ


def へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘへへヘへヘヘへへヘへへへへ):
    for へヘヘヘヘへヘへヘヘヘヘへへ in へヘヘヘへへヘへへヘヘへへへへヘへヘヘへヘヘヘへへヘヘへへヘヘヘへヘヘへへヘへヘ(へヘヘへへヘへヘヘへへヘへへへへ):
        yield (へヘヘヘヘへヘへヘヘヘヘへへ ** へヘヘヘへヘへへへヘへへへヘへ())


def へヘへへヘへヘへへへヘへへへへヘへ():
    へヘヘヘヘへヘへへヘヘヘヘヘヘ = へヘヘへヘへヘヘへヘへヘへヘへへへ(へヘヘヘへヘへヘヘへヘへへヘへへヘ())
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへへヘへヘへヘへヘ(), へヘヘヘヘへヘへへヘヘヘヘヘヘ.へヘへへヘへへへへへへへへへへヘヘ())
    へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへへへへヘヘへへへへへヘ(), へヘへへヘへヘへへヘへヘヘヘ())
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへへヘへへヘへへヘへへヘへヘ(), へヘへヘへヘへへへへへヘへへヘへ)
    へヘへへへヘへヘへヘヘヘへヘへへへ = [へヘヘヘへヘヘへヘヘへへへヘヘヘヘ ** へヘヘヘへヘへへへヘへへへヘへ()
                         for へヘヘヘへヘヘへヘヘへへへヘヘヘヘ in へヘヘヘへへヘへへヘヘへへへへヘへヘヘへヘヘヘへへヘヘへへヘヘヘへヘヘへへヘへヘ(へヘヘヘへヘへヘヘへヘへへヘへへヘ())]
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘへへへへへヘへヘへヘへへへへヘ(), へヘへへへヘへヘへヘヘヘへヘへへへ)
    try:
        へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘへヘへヘヘへヘへへヘへへヘ() / へヘヘへへへへへヘへヘヘへへヘヘヘ()
    except へヘへヘヘへヘへへヘヘへへヘへヘへヘヘヘへへヘへへヘヘへヘヘヘヘへヘへへへヘへへへヘヘへヘへへヘへヘヘヘへヘヘへへヘヘへヘへへヘへヘヘヘへへヘヘへヘヘへヘへへヘへヘヘへヘヘヘヘへヘヘへヘヘヘへへヘへへへヘへヘへヘヘヘへへヘへへヘヘヘへへヘへへヘヘへヘヘヘヘへヘヘヘへへヘへ:
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(へヘへヘヘヘヘヘへヘヘへヘヘへヘ())

    def へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ):
        return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘヘヘへヘへへへへヘへヘへへヘへ()
    へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
        へヘヘへヘへヘヘヘへヘヘヘへへヘヘ(), へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへへへへへへへヘヘヘヘへ()))
    for へヘへヘへヘへヘへヘへへへへ in へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘヘへへへへヘヘへへへへへヘ()):
        へヘヘヘへへへへへヘヘヘへへヘへへヘヘへヘへへヘへヘヘへヘヘヘへへヘヘヘへヘへへ(
            へヘヘヘヘヘヘヘヘへヘヘヘへ(), へヘへヘへヘへヘへヘへへへへ)


if へヘへヘヘヘヘヘへヘへヘヘヘヘヘへヘヘへヘヘヘへへヘヘへへへへヘへヘヘへヘヘへヘへヘヘへへヘへヘへヘへヘヘヘヘヘへヘへヘヘヘヘヘ == へヘへへヘヘヘへへへへへへへへヘ():
    へヘへへヘへヘへへへヘへへへへヘへ()
