def へヘへへヘヘヘへへへへへへへへヘ():
    return chr(95) + chr(95) + chr(109) + chr(97) + chr(105) + chr(110) + chr(95) + chr(95)


def へヘヘヘヘヘヘヘヘへヘヘヘへ():
    return chr(83) + chr(113) + chr(117) + chr(97) + chr(114) + chr(101) + chr(58) + chr(32)


def へヘヘヘへへへへへへへヘヘヘヘへ():
    return 738595 + 810040 - 648349 ^ 900279


def へヘヘへヘへヘヘヘへヘヘヘへへヘヘ():
    return chr(73) + chr(110) + chr(99) + chr(114) + chr(101) + chr(109) + chr(101) + chr(110) + chr(116) + chr(101) + chr(100) + chr(58) + chr(32)


def へヘヘヘへヘへへへへヘへヘへへヘへ():
    return 614333 + 493008 - 287457 ^ 819885


def へヘへヘヘヘヘヘへヘヘへヘヘへヘ():
    return chr(67) + chr(97) + chr(117) + chr(103) + chr(104) + chr(116) + chr(32) + chr(100) + chr(105) + chr(118) + chr(105) + chr(115) + chr(105) + chr(111) + chr(110) + chr(32) + chr(98) + chr(121) + chr(32) + chr(122) + chr(101) + chr(114) + chr(111) + chr(32) + chr(101) + chr(114) + chr(114) + chr(111) + chr(114)


def へヘヘへへへへへヘへヘヘへへヘヘヘ():
    return 326500 + 860093 - 602782 ^ 583811


def へヘへへへへへヘへヘへヘへへへへヘ():
    return chr(83) + chr(113) + chr(117) + chr(97) + chr(114) + chr(101) + chr(115) + chr(58) + chr(32)


def へヘヘへへヘへへヘへへヘへへヘへヘ():
    return chr(70) + chr(117) + chr(110) + chr(99) + chr(116) + chr(105) + chr(111) + chr(110) + chr(32) + chr(114) + chr(101) + chr(115) + chr(117) + chr(108) + chr(116) + chr(58) + chr(32)


def へヘへへヘへヘへへヘへヘヘヘ():
    return 201767 + 669950 - 589549 ^ 282175


def へヘヘヘへへへへヘヘへへへへへヘ():
    return 107720 + 661938 - 193910 ^ 575745


def へヘヘへへヘへヘへヘへヘ():
    return chr(68) + chr(111) + chr(117) + chr(98) + chr(108) + chr(101) + chr(100) + chr(32) + chr(86) + chr(97) + chr(108) + chr(117) + chr(101) + chr(58) + chr(32)


def へヘヘヘへヘへヘヘへヘへへヘへへヘ():
    return 1137418 + 314148 - 466393 ^ 985183


def へヘヘヘヘヘヘヘヘへヘへへへへ():
    return chr(70) + chr(117) + chr(110) + chr(99) + chr(116) + chr(105) + chr(111) + chr(110) + chr(32) + chr(99) + chr(97) + chr(108) + chr(108) + chr(32) + chr(99) + chr(111) + chr(109) + chr(112) + chr(108) + chr(101) + chr(116) + chr(101) + chr(100)


def へヘヘへへヘへへヘへヘへヘへヘへヘ():
    return chr(70) + chr(117) + chr(110) + chr(99) + chr(116) + chr(105) + chr(111) + chr(110) + chr(32) + chr(105) + chr(115) + chr(32) + chr(98) + chr(101) + chr(105) + chr(110) + chr(103) + chr(32) + chr(99) + chr(97) + chr(108) + chr(108) + chr(101) + chr(100)


def へヘヘヘへヘへへへヘへへへヘへ():
    return 1080717 + 277938 - 888007 ^ 470650


class へヘヘへヘへヘヘへヘへヘへヘへへへ:

    def __init__(self, へヘヘヘヘへへヘヘヘヘヘへヘへ):
        self.へヘヘヘヘへへヘヘヘヘヘへヘへ = へヘヘヘヘへへヘヘヘヘヘへヘへ

    def へヘへへヘへへへへへへへへへへヘヘ(self):
        return self.へヘヘヘヘへへヘヘヘヘヘへヘへ * へヘヘヘへヘへへへヘへへへヘへ()


def へヘへヘヘヘヘヘヘへへヘヘへへへ(へヘへへヘへへへヘヘヘヘヘへヘヘ):

    def へヘヘヘへへヘへへヘへヘへへヘへ(*へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ):
        print(へヘヘへへヘへへヘへヘへヘへヘへヘ())
        へヘへヘへヘへへへへへヘへへヘへ = へヘへへヘへへへヘヘヘヘヘへヘヘ(
            *へヘヘヘヘヘヘヘヘヘへヘヘヘへへ, **へヘへヘヘへへへへヘへヘヘヘへ)
        print(へヘヘヘヘヘヘヘヘへヘへへへへ())
        return へヘへヘへヘへへへへへヘへへヘへ
    return へヘヘヘへへヘへへヘへヘへへヘへ


@へヘへヘヘヘヘヘヘへへヘヘへへへ
def へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ, へヘへヘヘヘヘヘヘヘへヘへヘヘへ):
    return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘへヘヘヘヘヘヘヘへヘへヘヘへ


def へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘへへヘへヘヘへへヘへへへへ):
    for へヘヘヘヘへヘへヘヘヘヘへへ in range(へヘヘへへヘへヘヘへへヘへへへへ):
        yield (へヘヘヘヘへヘへヘヘヘヘへへ ** へヘヘヘへヘへへへヘへへへヘへ())


def へヘへへヘへヘへへへヘへへへへヘへ():
    へヘヘヘヘへヘへへヘヘヘヘヘヘ = へヘヘへヘへヘヘへヘへヘへヘへへへ(へヘヘヘへヘへヘヘへヘへへヘへへヘ())
    print(へヘヘへへヘへヘへヘへヘ(), へヘヘヘヘへヘへへヘヘヘヘヘヘ.へヘへへヘへへへへへへへへへへヘヘ())
    へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘヘへヘヘヘへへヘへヘ(へヘヘヘへへへへヘヘへへへへへヘ(), へヘへへヘへヘへへヘへヘヘヘ())
    print(へヘヘへへヘへへヘへへヘへへヘへヘ(), へヘへヘへヘへへへへへヘへへヘへ)
    へヘへへへヘへヘへヘヘヘへヘへへへ = [へヘヘヘへヘヘへヘヘへへへヘヘヘヘ ** へヘヘヘへヘへへへヘへへへヘへ()
                         for へヘヘヘへヘヘへヘヘへへへヘヘヘヘ in range(へヘヘヘへヘへヘヘへヘへへヘへへヘ())]
    print(へヘへへへへへヘへヘへヘへへへへヘ(), へヘへへへヘへヘへヘヘヘへヘへへへ)
    try:
        へヘへヘへヘへへへへへヘへへヘへ = へヘヘヘへヘへヘヘへヘへへヘへへヘ() / へヘヘへへへへへヘへヘヘへへヘヘヘ()
    except ZeroDivisionError:
        print(へヘへヘヘヘヘヘへヘヘへヘヘへヘ())

    def へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへヘヘへヘヘへへへヘヘヘヘ):
        return へヘヘヘへヘヘへヘヘへへへヘヘヘヘ + へヘヘヘへヘへへへへヘへヘへへヘへ()
    print(へヘヘへヘへヘヘヘへヘヘヘへへヘヘ(), へヘへヘヘヘヘへへへへへへヘヘヘへ(へヘヘヘへへへへへへへヘヘヘヘへ()))
    for へヘへヘへヘへヘへヘへへへへ in へヘへヘヘヘへへヘへへへヘヘヘヘ(へヘヘヘへへへへヘヘへへへへへヘ()):
        pass
    print(へヘヘヘヘヘヘヘヘへヘヘヘへ(), へヘへヘへヘへヘへヘへへへへ)


if __name__ == へヘへへヘヘヘへへへへへへへへヘ():
    へヘへへヘへヘへへへヘへへへへヘへ()
